---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IExternalApplication Members
IExternalApplication Interface Methods See Also Send Feedback
---

The IExternalApplication type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down. |
|  | OnStartup | Implement this method to execute some tasks when Autodesk Revit starts. |

# See Also

IExternalApplication Interface

Autodesk.Revit.UI Namespace